DocumentJournals/НачалоТермообработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DocumentJournal>
		<Properties>
			<Name>НачалоТермообработки</Name>
			<RegisteredDocuments>
				<xr:Item>Document.НачалоТермообработки</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>ПодПрограмма</Name>
					<References>
						<xr:Item>Document.НачалоТермообработки.Attribute.ПодПрограмма</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>МаксДата</Name>
					<References>
						<xr:Item>Document.НачалоТермообработки.Attribute.МаксДата</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>МаксЧасы</Name>
					<References>
						<xr:Item>Document.НачалоТермообработки.Attribute.МаксЧасы</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>МаксМинуты</Name>
					<References>
						<xr:Item>Document.НачалоТермообработки.Attribute.МаксМинуты</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ОтчетПроизводства</Name>
					<References>
						<xr:Item>Document.НачалоТермообработки.Attribute.ОтчетПроизводства</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ИтогПоВидамРам</Name>
					<References>
						<xr:Item>Document.НачалоТермообработки.Attribute.ИтогПоВидамРам</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДокументЗагрузка</Name>
					<References>
						<xr:Item>Document.НачалоТермообработки.Attribute.ДокументЗагрузка</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

Documents/НачалоТермообработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>НачалоТермообработки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МинДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодПрограммыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументЗагрузка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаКамеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогПоВидамРам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРамы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоРам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗагрузкаКамеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ЗагрузкаКамеры</Name>
			<BasedOn>
				<xr:Item>Document.НачалоТермообработки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КамераТермообработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КамерыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодПрограммыТермообработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженаЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗанятаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачалоТермообработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаКамеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободнаМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьНеоконченыеПроцессы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогРамПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРамы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоРам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоТермообработки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НачалоТермообработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DocumentJournals/НачалоТермообработки/Forms/ФормаСпискаУФ/Ext/Form/Module.bsl
// ======================================================================
// Процедура ПриОткрытии — инициализация формы при открытии
// + claude
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ВыбДата = ТекущаяДатаСеанса();

КонецПроцедуры // ПриОткрытии()

// ======================================================================
// Процедура ВыбДатаПриИзменении — обновление списка при изменении даты фильтра
// + claude
&НаКлиенте
Процедура ВыбДатаПриИзменении(Элемент)

	ОбновитьФильтрСписка();

КонецПроцедуры // ВыбДатаПриИзменении()

// ======================================================================
// Процедура ВыбПодпрограммаПриИзменении — обновление списка при изменении подпрограммы фильтра
// + claude
&НаКлиенте
Процедура ВыбПодпрограммаПриИзменении(Элемент)

	ОбновитьФильтрСписка();

КонецПроцедуры // ВыбПодпрограммаПриИзменении()

// ======================================================================
// Процедура ОбновитьФильтрСписка — устанавливает фильтр DynamicList по дате и подпрограмме
// + claude
&НаКлиенте
Процедура ОбновитьФильтрСписка()

	ЭлементыОтбора = Список.Отбор.Элементы;
	ЭлементыОтбора.Очистить();

	// Фильтр по дате
	Если ЗначениеЗаполнено(ВыбДата) Тогда
		НовыйЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Date");
		НовыйЭлемент.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент.ПравоеЗначение = НачалоДня(ВыбДата);
		НовыйЭлемент.Использование  = Истина;
	КонецЕсли; // фильтр по дате

	// Фильтр по подпрограмме
	Если ЗначениеЗаполнено(ВыбПодпрограмма) Тогда
		НовыйЭлемент = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПодПрограмма");
		НовыйЭлемент.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлемент.ПравоеЗначение = ВыбПодпрограмма;
		НовыйЭлемент.Использование  = Истина;
	КонецЕсли; // фильтр по подпрограмме

КонецПроцедуры // ОбновитьФильтрСписка()

// ======================================================================
// Команда ДокументыВТаблицу — добавляет все документы за выбранную дату и подпрограмму
// + claude
&НаКлиенте
Процедура ДокументыВТаблицу(Команда)

	Если НЕ ЗначениеЗаполнено(ВыбДата) Тогда
		Предупреждение("Укажите дату!");
		Возврат;
	КонецЕсли;

	ДокументыВТаблицуНаСервере();

КонецПроцедуры // ДокументыВТаблицу()

// ======================================================================
// + claude
&НаСервере
Процедура ДокументыВТаблицуНаСервере()

	// Выборка документов НачалоТермообработки за дату с фильтром по подпрограмме
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачалоТермообработки.Ссылка КАК Ссылка,
		|	НачалоТермообработки.Номер КАК Номер
		|ИЗ
		|	Документ.НачалоТермообработки КАК НачалоТермообработки
		|ГДЕ
		|	НачалоТермообработки.Дата >= &НачалоДня
		|	И НачалоТермообработки.Дата <= &КонецДня
		|	И НачалоТермообработки.ПометкаУдаления = ЛОЖЬ
		|	И (&ПодПрограммаНеЗаполнена ИЛИ НачалоТермообработки.ПодПрограмма = &ВыбПодпрограмма)
		|УПОРЯДОЧИТЬ ПО
		|	НачалоТермообработки.Номер";

	Запрос.УстановитьПараметр("НачалоДня",         НачалоДня(ВыбДата));
	Запрос.УстановитьПараметр("КонецДня",           КонецДня(ВыбДата));
	Запрос.УстановитьПараметр("ВыбПодпрограмма",    ВыбПодпрограмма);
	Запрос.УстановитьПараметр("ПодПрограммаНеЗаполнена", НЕ ЗначениеЗаполнено(ВыбПодпрограмма));

	Результат = Запрос.Выполнить().Выбрать();

	ТаблицаНачал.Очистить();
	Пока Результат.Следующий() Цикл
		// Проверяем — нет ли уже в таблице
		НайденныеСтроки = ТаблицаНачал.НайтиСтроки(Новый Структура("Ссылка", Результат.Ссылка));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаНачал.Добавить();
			НоваяСтрока.Начало = Результат.Номер;
			НоваяСтрока.Ссылка = Результат.Ссылка;
		КонецЕсли; // нет дубликата
	КонецЦикла; // перебор результата запроса

КонецПроцедуры // ДокументыВТаблицуНаСервере()

// ======================================================================
// Команда ТекущийВТаблицу — добавляет текущий документ в таблицу накопления
// + claude
&НаКлиенте
Процедура ТекущийВТаблицу(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Предупреждение("Не выбран документ в списке!");
		Возврат;
	КонецЕсли;

	СсылкаДок = ТекущиеДанные.Ссылка;
	Если НЕ ЗначениеЗаполнено(СсылкаДок) Тогда
		Возврат;
	КонецЕсли;

	// Проверяем дубликат
	НайденныеСтроки = ТаблицаНачал.НайтиСтроки(Новый Структура("Ссылка", СсылкаДок));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли; // уже есть

	НоваяСтрока = ТаблицаНачал.Добавить();
	НоваяСтрока.Начало = ТекущиеДанные.Number;
	НоваяСтрока.Ссылка = СсылкаДок;

КонецПроцедуры // ТекущийВТаблицу()

// ======================================================================
// Команда УдалитьСтрокуТаблицыНачал — удаляет выбранную строку из таблицы накопления
// + claude
&НаКлиенте
Процедура УдалитьСтрокуТаблицыНачал(Команда)

	ТекущаяСтрока = Элементы.ТаблицаНачал.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИндексСтроки = ТаблицаНачал.Индекс(ТекущаяСтрока);
	ТаблицаНачал.Удалить(ТекущаяСтрока);

	// Восстанавливаем позицию
	КолСтрок = ТаблицаНачал.Количество();
	Если КолСтрок > 0 Тогда
		НовыйИндекс = Мин(ИндексСтроки, КолСтрок - 1);
		Элементы.ТаблицаНачал.ТекущаяСтрока = ТаблицаНачал[НовыйИндекс];
	КонецЕсли; // есть строки

КонецПроцедуры // УдалитьСтрокуТаблицыНачал()

// ======================================================================
// Команда СформироватьЗагрузку — создаёт новый документ ЗагрузкаКамеры
// на основании документов НачалоТермообработки из таблицы накопления.
// Логика перенесена из 1С77 (процедура СформироватьЗагрузку), стиль — УТП.
// + claude
&НаКлиенте
Процедура СформироватьЗагрузку(Команда)

	Если ТаблицаНачал.Количество() = 0 Тогда
		Предупреждение("Таблица накопления пуста. Добавьте документы НачалоТермообработки.");
		Возврат;
	КонецЕсли;

	МассивСсылок = Новый Массив;
	Для Каждого СтрокаТЗ Из ТаблицаНачал Цикл
		МассивСсылок.Добавить(СтрокаТЗ.Ссылка);
	КонецЦикла; // перебор строк таблицы накопления

	Результат = СформироватьЗагрузкуНаСервере(МассивСсылок);

	// Обработка результата — Предупреждение и ОткрытьФорму только на клиенте
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Сообщение);
		Возврат;
	КонецЕсли;

	СтруктураПараметров = Новый Структура("Ключ", Результат.СсылкаДокумента);
	ОткрытьФорму("Документ.ЗагрузкаКамеры.ФормаОбъекта", СтруктураПараметров,, Истина);

КонецПроцедуры // СформироватьЗагрузку()

// ======================================================================
// Возвращает структуру: Ошибка (Булево), Сообщение (Строка), СсылкаДокумента
// + claude
&НаСервере
Функция СформироватьЗагрузкуНаСервере(МассивСсылок)

	Результат = Новый Структура("Ошибка, Сообщение, СсылкаДокумента", Ложь, "", Неопределено);

	// Проверяем, что все документы из одной подпрограммы
	ПодПрограммыВМассиве = Новый Массив;
	Для Каждого Ссылка Из МассивСсылок Цикл
		ПодПрогДок = Ссылка.ПодПрограмма;
		Если ПодПрограммыВМассиве.Найти(ПодПрогДок) = Неопределено Тогда
			ПодПрограммыВМассиве.Добавить(ПодПрогДок);
		КонецЕсли; // нет в массиве
	КонецЦикла; // перебор ссылок

	Если ПодПрограммыВМассиве.Количество() > 1 Тогда
		Результат.Ошибка   = Истина;
		Результат.Сообщение = "В документах таблицы разные подпрограммы!";
		Возврат Результат;
	ИначеЕсли ПодПрограммыВМассиве.Количество() = 0 Тогда
		Результат.Ошибка   = Истина;
		Результат.Сообщение = "Не удалось определить подпрограмму документов.";
		Возврат Результат;
	КонецЕсли; // проверка подпрограмм

	ТекПодпрограмма = ПодПрограммыВМассиве[0];

	МинДата    = Дата(1, 1, 1);
	МинЧасы    = 0;
	МинМинуты  = 0;
	МаксДата   = Дата(1, 1, 1);
	МаксЧасы   = 0;
	МаксМинуты = 0;

	ТЗЗагрузка = Новый ТаблицаЗначений;
	ТЗЗагрузка.Колонки.Добавить("ТМЦ");
	ТЗЗагрузка.Колонки.Добавить("ВидРамы");
	ТЗЗагрузка.Колонки.Добавить("Кво");
	ТЗЗагрузка.Колонки.Добавить("КвоРам");
	ТЗЗагрузка.Колонки.Добавить("ОтчетПроизводства");
	ТЗЗагрузка.Колонки.Добавить("НачалоТермообработки");

	Первый = Истина;

	Для Каждого Ссылка Из МассивСсылок Цикл

		ДокОбъект = Ссылка.ПолучитьОбъект();

		Для Каждого СтрокаТМЦ Из ДокОбъект.ТМЦ Цикл
			НоваяСтрока = ТЗЗагрузка.Добавить();
			НоваяСтрока.ТМЦ                  = СтрокаТМЦ.ТМЦ;
			НоваяСтрока.ВидРамы              = СтрокаТМЦ.ВидРамы;
			НоваяСтрока.Кво                  = СтрокаТМЦ.Кво;
			НоваяСтрока.КвоРам               = СтрокаТМЦ.КвоРам;
			НоваяСтрока.ОтчетПроизводства    = ДокОбъект.ОтчетПроизводства;
			НоваяСтрока.НачалоТермообработки = Ссылка;
		КонецЦикла; // перебор строк ТЧ ТМЦ

		// Граничное время — минимум (начало загрузки)
		Если Первый Тогда
			МинДата   = ДокОбъект.МинДата;
			МинЧасы   = ДокОбъект.МинЧасы;
			МинМинуты = ДокОбъект.МинМинуты;
		ИначеЕсли ДокОбъект.МинДата > МинДата Тогда
			МинДата   = ДокОбъект.МинДата;
			МинЧасы   = ДокОбъект.МинЧасы;
			МинМинуты = ДокОбъект.МинМинуты;
		ИначеЕсли ДокОбъект.МинДата = МинДата И ДокОбъект.МинЧасы > МинЧасы Тогда
			МинЧасы   = ДокОбъект.МинЧасы;
			МинМинуты = ДокОбъект.МинМинуты;
		ИначеЕсли ДокОбъект.МинДата = МинДата И ДокОбъект.МинЧасы = МинЧасы
				И ДокОбъект.МинМинуты > МинМинуты Тогда
			МинМинуты = ДокОбъект.МинМинуты;
		КонецЕсли; // граничное время мин

		// Граничное время — максимум (конец загрузки)
		Если Первый Тогда
			МаксДата   = ДокОбъект.МаксДата;
			МаксЧасы   = ДокОбъект.МаксЧасы;
			МаксМинуты = ДокОбъект.МаксМинуты;
		ИначеЕсли ДокОбъект.МаксДата < МаксДата Тогда
			МаксДата   = ДокОбъект.МаксДата;
			МаксЧасы   = ДокОбъект.МаксЧасы;
			МаксМинуты = ДокОбъект.МаксМинуты;
		ИначеЕсли ДокОбъект.МаксДата = МаксДата И ДокОбъект.МаксЧасы < МаксЧасы Тогда
			МаксЧасы   = ДокОбъект.МаксЧасы;
			МаксМинуты = ДокОбъект.МаксМинуты;
		ИначеЕсли ДокОбъект.МаксДата = МаксДата И ДокОбъект.МаксЧасы = МаксЧасы
				И ДокОбъект.МаксМинуты < МаксМинуты Тогда
			МаксМинуты = ДокОбъект.МаксМинуты;
		КонецЕсли; // граничное время макс

		Первый = Ложь;

	КонецЦикла; // перебор ссылок МассивСсылок

	НовыйДок = Документы.ЗагрузкаКамеры.СоздатьДокумент();
	НовыйДок.Дата            = МинДата;
	НовыйДок.ПодПрограмма   = ТекПодпрограмма;
	НовыйДок.МинДата         = МинДата;
	НовыйДок.МинЧасы         = МинЧасы;
	НовыйДок.МинМинуты       = МинМинуты;
	НовыйДок.МаксДата        = МаксДата;
	НовыйДок.МаксЧасы        = МаксЧасы;
	НовыйДок.МаксМинуты      = МаксМинуты;
	НовыйДок.ЗагруженаЧасы   = МинЧасы;
	НовыйДок.ЗагруженаМинуты = МинМинуты;

	Для Каждого СтрокаТЗ Из ТЗЗагрузка Цикл
		НоваяСтрокаТЧ                       = НовыйДок.ТМЦ.Добавить();
		НоваяСтрокаТЧ.ТМЦ                  = СтрокаТЗ.ТМЦ;
		НоваяСтрокаТЧ.ВидРамы              = СтрокаТЗ.ВидРамы;
		НоваяСтрокаТЧ.Кво                  = СтрокаТЗ.Кво;
		НоваяСтрокаТЧ.КвоРам               = СтрокаТЗ.КвоРам;
		НоваяСтрокаТЧ.НачалоТермообработки = СтрокаТЗ.НачалоТермообработки;
	КонецЦикла; // перебор строк ТЗЗагрузка

	НовыйДок.Записать(РежимЗаписиДокумента.Запись);

	Результат.СсылкаДокумента = НовыйДок.Ссылка;
	Возврат Результат;

КонецФункции // СформироватьЗагрузкуНаСервере()

// ======================================================================
// Команда ЗаполнитьНачалоТермообработки — выбор периода и создание документов
// НачалоТермообработки на основании Отчетов производства за смену.
// Логика перенесена из 1С77 (ЗаполнитьНачалоТермообработки в МодульПроведения
// ПриходнойНакладной), основание заменено на ОтчетПроизводстваЗаСмену. // + claude
&НаКлиенте
Процедура ЗаполнитьНачалоТермообработки(Команда)
	
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогПериода.Период = Новый СтандартныйПериод();
	ДиалогПериода.Период.ДатаНачала = ТекущаяДата();
	ДиалогПериода.Период.ДатаОкончания = ТекущаяДата();
	ДиалогПериода.Показать(Новый ОписаниеОповещения("ЗаполнитьНачалоТермообработкиПродолжение", ЭтаФорма));

КонецПроцедуры // ЗаполнитьНачалоТермообработки()

// ======================================================================
// Обработчик выбора периода — вызывается после закрытия диалога выбора периода // + claude
&НаКлиенте
Процедура ЗаполнитьНачалоТермообработкиПродолжение(ВыбранныйПериод, ДопПараметры) Экспорт

	Если ВыбранныйПериод = Неопределено Тогда
		Возврат;
	КонецЕсли; // отмена выбора периода

	НачалоПериода = ВыбранныйПериод.ДатаНачала;
	КонецПериода  = ВыбранныйПериод.ДатаОкончания;

	Результат = ЗаполнитьНачалоТермообработкиНаСервере(НачалоПериода, КонецПериода);

	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Сообщение);
		Возврат;
	КонецЕсли; // есть ошибки

	Состояние("Начало термообработки заполнено. Создано/обновлено документов: " + Результат.КоличествоДокументов);
	Элементы.Список.Обновить();

КонецПроцедуры // ЗаполнитьНачалоТермообработкиПродолжение()

// ======================================================================
// Формирует документы НачалоТермообработки по Отчетам производства за период.
// Возвращает структуру: Ошибка (Булево), Сообщение (Строка), КоличествоДокументов // + claude
&НаСервере
Функция ЗаполнитьНачалоТермообработкиНаСервере(НачалоПериода, КонецПериода)

	Результат = Новый Структура("Ошибка, Сообщение, КоличествоДокументов", Ложь, "", 0);

	// Аналог 1С77: очищаем НачалоТермообработки за период у которых нет ЗагрузкиКамеры // + claude
	ЗапросОчистка = Новый Запрос;
	ЗапросОчистка.Текст =
		"ВЫБРАТЬ
		|	НачалоТерм.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.НачалоТермообработки КАК НачалоТерм
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗагрузкаКамеры.ТМЦ КАК ЗагрузкаТМЦ
		|		ПО ЗагрузкаТМЦ.НачалоТермообработки = НачалоТерм.Ссылка
		|			И ЗагрузкаТМЦ.Ссылка.ПометкаУдаления = ЛОЖЬ
		|ГДЕ
		|	НачалоТерм.Дата >= &НачалоПериода
		|	И НачалоТерм.Дата <= &КонецПериода
		|	И НачалоТерм.ПометкаУдаления = ЛОЖЬ
		|	И ЗагрузкаТМЦ.Ссылка ЕСТЬ NULL";
	ЗапросОчистка.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	ЗапросОчистка.УстановитьПараметр("КонецПериода",  КонецДня(КонецПериода));

	ВыборкаОчистка = ЗапросОчистка.Выполнить().Выбрать();
	Пока ВыборкаОчистка.Следующий() Цикл
		ДокОчистка = ВыборкаОчистка.Ссылка.ПолучитьОбъект();
		ДокОчистка.ТМЦ.Очистить();
		ДокОчистка.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла; // очистка НачалоТермообработки без загрузок

	// Выбираем строки Продукция всех ОтчетПроизводстваЗаСмену за период
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Продукция.Ссылка       КАК ОтчетПроизводства,
		|	Продукция.Ссылка.Дата  КАК ДатаДокумента,
		|	Продукция.Номенклатура КАК Номенклатура,
		|	Продукция.Количество   КАК Кво
		|ИЗ
		|	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК Продукция
		|ГДЕ
		|	Продукция.Ссылка.Дата >= &НачалоПериода
		|	И Продукция.Ссылка.Дата <= &КонецПериода
		|	И Продукция.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И Продукция.Ссылка.Проведен = ИСТИНА
		|УПОРЯДОЧИТЬ ПО
		|	Продукция.Ссылка.Дата,
		|	Продукция.НомерСтроки";

	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(КонецПериода));

	ВыборкаПродукция = Запрос.Выполнить().Выбрать();

	// Строим таблицу термообработки — аналог ТЗ_Термообработка из 1С77
	ТЗ_Термообработка = Новый ТаблицаЗначений;
	ТЗ_Термообработка.Колонки.Добавить("ДатаНачала",        Новый ОписаниеТипов("Дата"));
	ТЗ_Термообработка.Колонки.Добавить("НачалоЧасы",        Новый ОписаниеТипов("Число"));
	ТЗ_Термообработка.Колонки.Добавить("НачалоМинуты",      Новый ОписаниеТипов("Число"));
	ТЗ_Термообработка.Колонки.Добавить("МаксДата",          Новый ОписаниеТипов("Дата"));
	ТЗ_Термообработка.Колонки.Добавить("МаксЧасы",          Новый ОписаниеТипов("Число"));
	ТЗ_Термообработка.Колонки.Добавить("МаксМинуты",        Новый ОписаниеТипов("Число"));
	ТЗ_Термообработка.Колонки.Добавить("Номенклатура");
	ТЗ_Термообработка.Колонки.Добавить("Подпрограмма");
	ТЗ_Термообработка.Колонки.Добавить("Кво",               Новый ОписаниеТипов("Число"));
	ТЗ_Термообработка.Колонки.Добавить("ОтчетПроизводства");
	ТЗ_Термообработка.Колонки.Добавить("ДатаДокумента",     Новый ОписаниеТипов("Дата"));

	ТекстОшибок = "";

	Пока ВыборкаПродукция.Следующий() Цикл

		Номенклатура = ВыборкаПродукция.Номенклатура;
		ДатаДок      = НачалоДня(ВыборкаПродукция.ДатаДокумента); // нормализуем до полуночи

		// Пропускаем номенклатуру без программы термообработки
		Если Номенклатура.БезПрограммыТермообработки Тогда
			Продолжить;
		КонецЕсли; // без программы

		// Получаем первую подпрограмму номенклатуры из справочника ПодпрограммыНоменклатуры
		ЗапросПодпрогр = Новый Запрос;
		ЗапросПодпрогр.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПодпрограммыНоменклатуры.Подпрограмма КАК Подпрограмма
			|ИЗ
			|	Справочник.ПодпрограммыНоменклатуры КАК ПодпрограммыНоменклатуры
			|ГДЕ
			|	ПодпрограммыНоменклатуры.Владелец = &Номенклатура
			|	И ПодпрограммыНоменклатуры.ПометкаУдаления = ЛОЖЬ
			|УПОРЯДОЧИТЬ ПО
			|	ПодпрограммыНоменклатуры.Код";
		ЗапросПодпрогр.УстановитьПараметр("Номенклатура", Номенклатура);
		ВыборкаПодпрогр = ЗапросПодпрогр.Выполнить().Выбрать();

		Если НЕ ВыборкаПодпрогр.Следующий() Тогда
			ТекстОшибок = ТекстОшибок + "У номенклатуры " + Номенклатура + " не заданы программы термообработки" + Символы.ПС;
			Продолжить;
		КонецЕсли; // нет подпрограммы

		Подпрограмма = ВыборкаПодпрогр.Подпрограмма; // CatalogRef.ПодПрограммыТермообработки

		// Суммируем длительность процессов подпрограммы из ПроцессПодПрограммыТермообработки // + claude
		ЗапросПроцессы = Новый Запрос;
		ЗапросПроцессы.Текст =
			"ВЫБРАТЬ
			|	СУММА(Процессы.ДлинаПроцесса) КАК ТекМинутПрограммы
			|ИЗ
			|	Справочник.ПроцессПодПрограммыТермообработки КАК Процессы
			|ГДЕ
			|	Процессы.Владелец = &Подпрограмма
			|	И Процессы.ПометкаУдаления = ЛОЖЬ";
		ЗапросПроцессы.УстановитьПараметр("Подпрограмма", Подпрограмма);
		ВыборкаПроцессы = ЗапросПроцессы.Выполнить().Выбрать();

		ТекМинутПрограммы = 0;
		Если ВыборкаПроцессы.Следующий() И ВыборкаПроцессы.ТекМинутПрограммы <> NULL Тогда
			ТекМинутПрограммы = ВыборкаПроцессы.ТекМинутПрограммы;
		КонецЕсли; // есть минуты

		Если ТекМинутПрограммы = 0 Тогда
			Продолжить;
		КонецЕсли; // нет длительности

		// Рассчитываем дату/время начала и макс — аналог логики 1С77
		ДнейНазад = ОкрВверх(ТекМинутПрограммы / 60 / 24); // + ОкрВверх

		НоваяСтрока                   = ТЗ_Термообработка.Добавить();
		НоваяСтрока.Номенклатура      = Номенклатура;
		НоваяСтрока.Подпрограмма      = Подпрограмма;
		НоваяСтрока.Кво               = ВыборкаПродукция.Кво;
		НоваяСтрока.ОтчетПроизводства = ВыборкаПродукция.ОтчетПроизводства;
		НоваяСтрока.ДатаДокумента     = ДатаДок;

		Если ДнейНазад = 1 Тогда // время процессов укладывается в сутки
			МинутНачала = (24 * 60) - ТекМинутПрограммы; // минут от полуночи до момента начала
			КомпВремени = ПереводМинутВКомпоненты(МинутНачала);
			НоваяСтрока.ДатаНачала   = ДатаДок - 86400; // предыдущие сутки
			НоваяСтрока.НачалоЧасы   = КомпВремени.Часы;
			НоваяСтрока.НачалоМинуты = КомпВремени.Минуты;
			НоваяСтрока.МаксДата     = ДатаДок;          // дата документа = крайний срок
			НоваяСтрока.МаксЧасы     = КомпВремени.Часы;
			НоваяСтрока.МаксМинуты   = КомпВремени.Минуты;
		Иначе
			ТекРасчетнаяДата = ДатаДок - ДнейНазад * 86400; // отодвигаемся назад на ДнейНазад суток
			МинутНачала = ДнейНазад * 24 * 60 - ТекМинутПрограммы;
			КомпНачала  = ПереводМинутВКомпоненты(МинутНачала);
			НоваяСтрока.ДатаНачала   = ТекРасчетнаяДата + КомпНачала.Дни * 86400;
			НоваяСтрока.НачалоЧасы   = КомпНачала.Часы;
			НоваяСтрока.НачалоМинуты = КомпНачала.Минуты;
			МаксимальноМинут = МинутНачала + (24 * 60); // окно в сутки от начала
			КомпМакс = ПереводМинутВКомпоненты(МаксимальноМинут);
			НоваяСтрока.МаксДата   = ТекРасчетнаяДата + КомпМакс.Дни * 86400;
			НоваяСтрока.МаксЧасы   = КомпМакс.Часы;
			НоваяСтрока.МаксМинуты = КомпМакс.Минуты;
		КонецЕсли; // ДнейНазад

	КонецЦикла; // перебор строк продукции

	Если ТекстОшибок <> "" Тогда
		Результат.Ошибка   = Истина;
		Результат.Сообщение = ТекстОшибок;
		Возврат Результат;
	КонецЕсли; // есть ошибки номенклатуры

	Если ТЗ_Термообработка.Количество() = 0 Тогда
		Результат.Сообщение = "Не найдено строк продукции в Отчетах производства за указанный период.";
		Возврат Результат;
	КонецЕсли; // пустая таблица

	ТЗ_Термообработка.Сортировать("ДатаНачала, НачалоЧасы, НачалоМинуты, Номенклатура");

	КоличествоДокументов = 0;

	// Создаём/обновляем документы НачалоТермообработки — аналог цикла из 1С77
	Для Каждого СтрокаТЗ Из ТЗ_Термообработка Цикл

		// Ищем существующий документ с такими же параметрами
		ЗапросДок = Новый Запрос;
		ЗапросДок.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	НачалоТермообработки.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.НачалоТермообработки КАК НачалоТермообработки
			|ГДЕ
			|	НачалоТермообработки.Дата >= &НачалоДня
			|	И НачалоТермообработки.Дата <= &КонецДня
			|	И НачалоТермообработки.ПодПрограмма = &Подпрограмма
			|	И НачалоТермообработки.ОтчетПроизводства = &ОтчетПроизводства
			|	И НачалоТермообработки.МинДата = &ДатаНачала
			|	И НачалоТермообработки.МинЧасы = &НачалоЧасы
			|	И НачалоТермообработки.МинМинуты = &НачалоМинуты
			|	И НачалоТермообработки.ПометкаУдаления = ЛОЖЬ";
		ЗапросДок.УстановитьПараметр("НачалоДня",         НачалоДня(СтрокаТЗ.ДатаНачала));
		ЗапросДок.УстановитьПараметр("КонецДня",          КонецДня(СтрокаТЗ.ДатаНачала));
		ЗапросДок.УстановитьПараметр("Подпрограмма",      СтрокаТЗ.Подпрограмма);
		ЗапросДок.УстановитьПараметр("ОтчетПроизводства", СтрокаТЗ.ОтчетПроизводства);
		ЗапросДок.УстановитьПараметр("ДатаНачала",        СтрокаТЗ.ДатаНачала);
		ЗапросДок.УстановитьПараметр("НачалоЧасы",        СтрокаТЗ.НачалоЧасы);
		ЗапросДок.УстановитьПараметр("НачалоМинуты",      СтрокаТЗ.НачалоМинуты);

		ВыборкаДок = ЗапросДок.Выполнить().Выбрать();

		Если ВыборкаДок.Следующий() Тогда
			ДокОбъект = ВыборкаДок.Ссылка.ПолучитьОбъект();
		Иначе
			ДокОбъект                      = Документы.НачалоТермообработки.СоздатьДокумент();
			ДокОбъект.Дата                 = СтрокаТЗ.ДатаНачала;
			ДокОбъект.ПодПрограмма         = СтрокаТЗ.Подпрограмма;
			ДокОбъект.ОтчетПроизводства    = СтрокаТЗ.ОтчетПроизводства;
			ДокОбъект.МинДата              = СтрокаТЗ.ДатаНачала;
			ДокОбъект.МинЧасы              = СтрокаТЗ.НачалоЧасы;
			ДокОбъект.МинМинуты            = СтрокаТЗ.НачалоМинуты;
			ДокОбъект.НачалоЧасы           = СтрокаТЗ.НачалоЧасы;
			ДокОбъект.НачалоМинуты         = СтрокаТЗ.НачалоМинуты;
			ДокОбъект.МаксДата             = СтрокаТЗ.МаксДата;
			ДокОбъект.МаксЧасы             = СтрокаТЗ.МаксЧасы;
			ДокОбъект.МаксМинуты           = СтрокаТЗ.МаксМинуты;
			КоличествоДокументов = КоличествоДокументов + 1;
		КонецЕсли; // найден/создан документ

		// Ищем строку ТМЦ — если есть, обновляем, иначе добавляем
		НайденнаяСтрока = Неопределено;
		Для Каждого СтрокаТМЦ Из ДокОбъект.ТМЦ Цикл
			Если СтрокаТМЦ.ТМЦ = СтрокаТЗ.Номенклатура Тогда
				НайденнаяСтрока = СтрокаТМЦ;
				Прервать;
			КонецЕсли;
		КонецЦикла; // поиск строки ТМЦ

		Если НайденнаяСтрока = Неопределено Тогда
			НайденнаяСтрока = ДокОбъект.ТМЦ.Добавить();
		КонецЕсли; // новая строка

		НайденнаяСтрока.ТМЦ     = СтрокаТЗ.Номенклатура;
		НайденнаяСтрока.Кво     = СтрокаТЗ.Кво;
		НайденнаяСтрока.ВидРамы = СтрокаТЗ.Номенклатура.ВидРамы;
		Если СтрокаТЗ.Номенклатура.КвоПродукцииНаРаме > 0 Тогда
			НайденнаяСтрока.КвоРам = СтрокаТЗ.Кво / СтрокаТЗ.Номенклатура.КвоПродукцииНаРаме;
		КонецЕсли; // есть количество на раме

		// Обновляем итог по видам рам — аналог ИтогПоВидамРам из 1С77
		ТЗВрем = ДокОбъект.ТМЦ.Выгрузить();
		ТЗВрем.Свернуть("ВидРамы", "КвоРам");
		ТекИтог = "";
		Для Каждого СтрВид Из ТЗВрем Цикл
			ТекИтог = СокрЛП(ТекИтог) + Лев(СокрЛП(Строка(СтрВид.ВидРамы)), 1) + СокрЛП(Формат(СтрВид.КвоРам, "Ч12.2")) + ",";
		КонецЦикла; // перебор видов рам
		ДокОбъект.ИтогПоВидамРам = ТекИтог;

		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);

	КонецЦикла; // перебор строк ТЗ_Термообработка

	Результат.КоличествоДокументов = КоличествоДокументов;
	Возврат Результат;

КонецФункции // ЗаполнитьНачалоТермообработкиНаСервере()

// ======================================================================
// Переводит количество минут в структуру {Дни, Часы, Минуты} // + claude
&НаСервере
Функция ПереводМинутВКомпоненты(КоличествоМинут)

	Рез        = Новый Структура("Дни, Часы, Минуты", 0, 0, 0);
	Рез.Дни    = Цел(КоличествоМинут / 60 / 24);
	Остаток    = КоличествоМинут - Рез.Дни * 60 * 24;
	Рез.Часы   = Цел(Остаток / 60);
	Рез.Минуты = Остаток % 60;
	Возврат Рез;

КонецФункции // ПереводМинутВКомпоненты()

// ======================================================================
// Округление вверх — аналог глОкрВверх из 1С77 // + claude
&НаСервере
Функция ОкрВверх(Значение)

	Если Цел(Значение) = Значение Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат Цел(Значение) + 1;

КонецФункции // ОкрВверх()
